export const myText1 = `ယနေ့ အတွက် ဖတ်စရာ...။`
export const myText2 = `မျက်ခုံး တစ်ဖက်လှုပ်နေလို့ ချဲပေါက်မယ် ထင်နေတာ။ ပါးတစ်ခြမ်းပါ ရွဲ့လာမှ လေဖြတ်မှန်း သိတယ်...`
//export const myText2 = `ကောင်းနိုးရာရာတွေ ဖန်တီးသူ ချစ်မေတ္တာတွေ နင် တကယ် မသိတတ် အရက်မသောက်ခင်မှာ အမြည်းတွေ ကုန်နေပြီ...`
// export const myText2 = `စိတ်ကျန်းမာရေးဆေးရုံမှာပေါ့....။
// တစ်နေ့ဆေးရုံအုပ်ကြီးက ဝေဒနာသည်တွေကိုဆေးစစ်သတဲ့။
// ဆေးစစ်တဲ့အနေနဲ့ ခေါက်ဆွဲကျွေးတာပေါ့။
// ဒါပေမဲ့ ဘာခေါက်ဆွဲမှမပါ ပါဘူး ။ဇွန်းနဲ့ ပန်းကန်သာပါတဲ့ ခေါက်ဆွဲကျွေးပွဲပါ။
// စိတ်ဝေဒနာသည်တွေ ဆိုတော့အပြိုင်အဆိုင် စားကြတာပေါ့။
// ဒီအထဲမှာတစ်ယောက်ကမစားဘူးခင်ဗျ။
// ဒါနဲ့ဆေးရုံအုပ်ကြီးက ကောင်းသွားပြီလို့မှတ်ချတ်ချကာ
// အနားခေါ်ပြီးဆေးစစ်သတဲ့....။
// အုပ် ။မင်းကျန်းမာရေးအခြေအနေတိုးတက်ကောင်းမွန်လာပြီကွ၊ဒါနဲ့ စကားမစပ် ငါကျွေးတဲ့ခေါက်ဆွဲ
// ကိုဘာလို့ မစားတာလဲ ဖြေစမ်းပါအုန်း။မင်းကမကြိုက်လို့လား။
// လူနာ ။ မဟုတ်ပါဘူး ခင်ဗျ။
// အုပ် ။(ဟုတ်ပြီဆိုတဲ့အထာနဲ့ သူ့လက်ထောက်ကို မျက်စပစ်ပြရင်း)ကဲ...ဒါဆိုဘာလို့မစားတာလဲ ဖြေစမ်းပါအုန်းကွာ။
// လူနာ ။ ဟုတ်ကဲ့....ကျွန်တော်က ပူနေရင်မစားတက်လို့ အေးအောင်စောင့်နေတာပါ ခင်ဗျ။ကျွန်တော်တို့ကို အခုလို ကျွေးတဲ့အတွက် ကျေးဇူတင်ပါတယ်။
// `
